'''
print("{}说：今天天气不错".format("zeze"))
print("{}说：今天天气{}".format("zeze", "很好"))
print("{0:}说：今天天气{1:}".format("zeze", "很好"))
print("{1:}说：今天天气{0:}".format("zeze", "很好"))
'''

# 格式控制标记

s = "计算机二级"

# 默认宽度30，如果宽度小于字符串宽度，则原封不动
print("{:30}".format(s))

# 居中对齐
print("{:^30}".format(s))

# 左右对齐
print("{:<30}".format(s))
print("{:>30}".format(s))

# *填充
print("{:*>30}".format(s))
print("{:*^30}".format(s))

# 千位分隔符
print("{:-^25,}".format(123456789))

# 千位分隔符并保留两位小数，四舍五入
print("{:-^25,.2f}".format(123456789.1415))
print("{:-^25,.2f}".format(123456789.1455))

# 保留三位小数，四舍五入
print("{:.3f}".format(123456789.1455))

# 字符串
# b：二进制形式  c：对应的 Unicode 字符
# d：十进制  o：八进制形式
# x：小写十六进制形式  X：大写十六进制形式
print("{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}".format(97))

# 浮点数
# e：小写字母 e 的指数形式；E：大写字母 E 的指数形式
# f：标准浮点数；%：输出百分百的形式
print("{0:e},{0:E},{0:f},{0:%}".format(3.141))
